src/test/resources/PERSONAL_INFO.XSD

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsvc="urn:com.workday/bsvc">
    <soapenv:Header>
    </soapenv:Header>
    <soapenv:Body>
        <bsvc:Maintain_Contact_Information_for_Person_Event_Request bsvc:version="${version}">
            <bsvc:Maintain_Contact_Information_Data>
                <bsvc:Worker_Reference>
                    <bsvc:ID bsvc:type="${WORKER_TYPE}">${WORKER_ID}</bsvc:ID>
                </bsvc:Worker_Reference>
                <bsvc:Effective_Date>${EFFECTIVE_DATE}</bsvc:Effective_Date>
                <bsvc:Worker_Contact_Information_Data>
                    <bsvc:Email_Address_Data bsvc:Delete="false" bsvc:Do_Not_Replace_All="true">
                        <bsvc:Email_Address>${EMAIL_ADDRESS}</bsvc:Email_Address>
                        <bsvc:Usage_Data bsvc:Public="${EMAIL_PUBLIC}">
                            <bsvc:Type_Data bsvc:Primary="${EMAIL_PRIMARY}">
                                <bsvc:Type_Reference>
                                    <bsvc:ID bsvc:type="Communication_Usage_Type_ID">${EMAIL_USAGE_TYPE}</bsvc:ID>
                                </bsvc:Type_Reference>
                            </bsvc:Type_Data>
                        </bsvc:Usage_Data>
                    </bsvc:Email_Address_Data>
                </bsvc:Worker_Contact_Information_Data>
            </bsvc:Maintain_Contact_Information_Data>
        </bsvc:Maintain_Contact_Information_for_Person_Event_Request>
    </soapenv:Body>
</soapenv:Envelope>